---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.SweepFailures
source: html/6b87d031-66fd-ff37-0845-81e92c3d8dc1.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SweepFailures

Failures about Sweep.

## Syntax (C#)
```csharp
public static class SweepFailures
```